clouddevnorway21/perfproducer1.txt
4978 records sent, 995.6 records/sec (0.09 MB/sec), 72.0 ms avg latency, 789.0 ms max latency.
5003 records sent, 1000.4 records/sec (0.10 MB/sec), 22.2 ms avg latency, 65.0 ms max latency.
4999 records sent, 999.8 records/sec (0.10 MB/sec), 23.9 ms avg latency, 121.0 ms max latency.
4998 records sent, 999.6 records/sec (0.10 MB/sec), 22.7 ms avg latency, 125.0 ms max latency.
5006 records sent, 1001.2 records/sec (0.10 MB/sec), 22.5 ms avg latency, 122.0 ms max latency.
4997 records sent, 999.4 records/sec (0.10 MB/sec), 22.1 ms avg latency, 77.0 ms max latency.
5006 records sent, 1001.0 records/sec (0.10 MB/sec), 22.8 ms avg latency, 86.0 ms max latency.
4998 records sent, 999.6 records/sec (0.10 MB/sec), 22.8 ms avg latency, 123.0 ms max latency.
4336 records sent, 861.9 records/sec (0.08 MB/sec), 117.8 ms avg latency, 717.0 ms max latency.
5328 records sent, 1049.2 records/sec (0.10 MB/sec), 232.8 ms avg latency, 883.0 ms max latency.
4578 records sent, 907.4 records/sec (0.09 MB/sec), 751.6 ms avg latency, 1990.0 ms max latency.
5910 records sent, 1181.3 records/sec (0.11 MB/sec), 201.7 ms avg latency, 1087.0 ms max latency.
4695 records sent, 934.9 records/sec (0.09 MB/sec), 58.1 ms avg latency, 250.0 ms max latency.
5332 records sent, 1066.0 records/sec (0.10 MB/sec), 82.9 ms avg latency, 510.0 ms max latency.
5009 records sent, 1000.8 records/sec (0.10 MB/sec), 37.4 ms avg latency, 137.0 ms max latency.
5006 records sent, 1001.0 records/sec (0.10 MB/sec), 22.2 ms avg latency, 81.0 ms max latency.
4963 records sent, 989.0 records/sec (0.09 MB/sec), 22.4 ms avg latency, 117.0 ms max latency.
5057 records sent, 1011.0 records/sec (0.10 MB/sec), 23.5 ms avg latency, 181.0 ms max latency.
5003 records sent, 1000.2 records/sec (0.10 MB/sec), 22.4 ms avg latency, 78.0 ms max latency.
5002 records sent, 1000.2 records/sec (0.10 MB/sec), 22.7 ms avg latency, 78.0 ms max latency.
5001 records sent, 1000.2 records/sec (0.10 MB/sec), 22.3 ms avg latency, 104.0 ms max latency.
5000 records sent, 999.8 records/sec (0.10 MB/sec), 21.8 ms avg latency, 86.0 ms max latency.
5002 records sent, 1000.2 records/sec (0.10 MB/sec), 23.0 ms avg latency, 75.0 ms max latency.
5000 records sent, 1000.0 records/sec (0.10 MB/sec), 22.2 ms avg latency, 96.0 ms max latency.
5001 records sent, 1000.0 records/sec (0.10 MB/sec), 23.3 ms avg latency, 133.0 ms max latency.
5001 records sent, 999.6 records/sec (0.10 MB/sec), 22.1 ms avg latency, 65.0 ms max latency.
5003 records sent, 1000.4 records/sec (0.10 MB/sec), 22.3 ms avg latency, 64.0 ms max latency.
5001 records sent, 1000.2 records/sec (0.10 MB/sec), 23.5 ms avg latency, 76.0 ms max latency.
5000 records sent, 1000.0 records/sec (0.10 MB/sec), 23.5 ms avg latency, 159.0 ms max latency.
4990 records sent, 998.0 records/sec (0.10 MB/sec), 23.1 ms avg latency, 75.0 ms max latency.
5011 records sent, 1002.2 records/sec (0.10 MB/sec), 22.8 ms avg latency, 79.0 ms max latency.
5002 records sent, 1000.0 records/sec (0.10 MB/sec), 23.6 ms avg latency, 121.0 ms max latency.
4999 records sent, 999.8 records/sec (0.10 MB/sec), 22.8 ms avg latency, 114.0 ms max latency.
5004 records sent, 1000.0 records/sec (0.10 MB/sec), 21.8 ms avg latency, 52.0 ms max latency.
5002 records sent, 999.2 records/sec (0.10 MB/sec), 24.6 ms avg latency, 121.0 ms max latency.
5003 records sent, 999.4 records/sec (0.10 MB/sec), 22.5 ms avg latency, 78.0 ms max latency.
5012 records sent, 1002.4 records/sec (0.10 MB/sec), 22.8 ms avg latency, 111.0 ms max latency.
5001 records sent, 1000.2 records/sec (0.10 MB/sec), 22.4 ms avg latency, 70.0 ms max latency.
4998 records sent, 999.6 records/sec (0.10 MB/sec), 23.0 ms avg latency, 95.0 ms max latency.
5004 records sent, 1000.4 records/sec (0.10 MB/sec), 23.0 ms avg latency, 63.0 ms max latency.
4996 records sent, 999.0 records/sec (0.10 MB/sec), 23.0 ms avg latency, 106.0 ms max latency.
5005 records sent, 1000.8 records/sec (0.10 MB/sec), 23.8 ms avg latency, 96.0 ms max latency.
5000 records sent, 1000.0 records/sec (0.10 MB/sec), 23.4 ms avg latency, 115.0 ms max latency.
4880 records sent, 976.0 records/sec (0.09 MB/sec), 25.8 ms avg latency, 165.0 ms max latency.
5121 records sent, 1024.0 records/sec (0.10 MB/sec), 24.8 ms avg latency, 152.0 ms max latency.
5004 records sent, 1000.8 records/sec (0.10 MB/sec), 22.3 ms avg latency, 100.0 ms max latency.
5000 records sent, 999.8 records/sec (0.10 MB/sec), 23.8 ms avg latency, 132.0 ms max latency.
5003 records sent, 1000.4 records/sec (0.10 MB/sec), 26.1 ms avg latency, 102.0 ms max latency.
5002 records sent, 1000.2 records/sec (0.10 MB/sec), 22.2 ms avg latency, 118.0 ms max latency.
4743 records sent, 928.5 records/sec (0.09 MB/sec), 50.1 ms avg latency, 415.0 ms max latency.
5368 records sent, 1073.2 records/sec (0.10 MB/sec), 90.9 ms avg latency, 429.0 ms max latency.
5002 records sent, 999.6 records/sec (0.10 MB/sec), 23.9 ms avg latency, 90.0 ms max latency.
5002 records sent, 1000.2 records/sec (0.10 MB/sec), 22.6 ms avg latency, 101.0 ms max latency.
5003 records sent, 1000.2 records/sec (0.10 MB/sec), 21.8 ms avg latency, 76.0 ms max latency.
5002 records sent, 1000.0 records/sec (0.10 MB/sec), 25.7 ms avg latency, 100.0 ms max latency.
5000 records sent, 1000.0 records/sec (0.10 MB/sec), 22.2 ms avg latency, 116.0 ms max latency.
5001 records sent, 1000.2 records/sec (0.10 MB/sec), 22.1 ms avg latency, 106.0 ms max latency.
5001 records sent, 1000.2 records/sec (0.10 MB/sec), 22.1 ms avg latency, 53.0 ms max latency.
4995 records sent, 999.0 records/sec (0.10 MB/sec), 22.3 ms avg latency, 93.0 ms max latency.
300000 records sent, 999.903343 records/sec (0.10 MB/sec), 47.09 ms avg latency, 1990.00 ms max latency, 21 ms 50th, 109 ms 95th, 675 ms 99th, 1836 ms 99.9th.