clouddevnorway21/perfproducer2.txt
45096 records sent, 9017.4 records/sec (0.86 MB/sec), 247.7 ms avg latency, 900.0 ms max latency.
46036 records sent, 9187.0 records/sec (0.88 MB/sec), 558.9 ms avg latency, 1944.0 ms max latency.
43372 records sent, 8674.4 records/sec (0.83 MB/sec), 863.9 ms avg latency, 4142.0 ms max latency.
32384 records sent, 6470.3 records/sec (0.62 MB/sec), 1851.3 ms avg latency, 6261.0 ms max latency.
41743 records sent, 8333.6 records/sec (0.79 MB/sec), 2153.8 ms avg latency, 9255.0 ms max latency.
42583 records sent, 8492.8 records/sec (0.81 MB/sec), 3162.4 ms avg latency, 11812.0 ms max latency.
300000 records sent, 8660.508083 records/sec (0.83 MB/sec), 2589.88 ms avg latency, 11819.00 ms max latency, 654 ms 50th, 11332 ms 95th, 11731 ms 99th, 11795 ms 99.9th.